Autodesk.Revit.DB.RevitLinkOperations.SetOnLocalLinkSharedCoordinatesSavedCallback(Autodesk.Revit.DB.IOnLocalLinkSharedCoordinatesSavedCallback)
Sets the callback that will be called when the Revit user saves new shared coordinate
settings to a linked document obtained from an IExternalResourceServer.
onLocalLinkSharedCoordinatesSaved:
An IOnLocalLinkSharedCoordinatesSavedCallback object that can respond when the user
saves new shared coordinates to a Revit link document obtained from IExternalResourceServer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.RevitLinkOperations.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014